{
  "name": "Youssef Elsabawy",
  "heroSection": {
    "myPicture": "",
    "bio": "Versatile Full Stack Engineer shaping modern products and experiences that connect people, ideas, and technology.",
    "happyClients": [
      {
        "pictureUrl": "/companies/Eontech.png",
        "alt": "Eontech"
      },
      {
        "pictureUrl": "/companies/Paintiro.png",
        "alt": "Paintiro"
      },
      {
        "pictureUrl": "/companies/Ingenium.png",
        "alt": "Ingenium"
      }
    ]
  },

  "aboutSection": {
    "whoIs": "Youssef",
    "startYear": 2021,
    "bio": "I’m Youssef Elsabawy, a Full Stack Engineer with {yearsOfExperience} of experience in both frontend and backend development, creating digital products that perform, scale, and inspire."
  },
  "aboutPage": {
    "whoIs": "Youssef Elsabawy",
    "story": "I was born on 1st August 1999 in Alexandria, Egypt. From a young age, I developed a passion for basketball, playing actively from 6 to 16 years old, which taught me discipline, teamwork, and perseverance. In 2017, I began studying Computer Science, exploring programming and problem-solving, and graduated in 2021 with a solid foundation in technology. After graduation, I joined the Egyptian Army, serving in the Naval Security, where I gained resilience and the ability to perform under pressure. Following my service, I started my professional career at TechHive as a Full Stack Engineer, applying my skills to real-world projects and continuously growing as a developer.",
    "reflection": "These experiences from sports to academics, military service, and professional work have shaped who I am today. They taught me discipline, curiosity, perseverance, and problem-solving. I am committed to continuous learning, personal growth, and making a positive impact through my work and life.",
    "Technical": "I am a highly skilled Full Stack Software Engineer specializing in frontend and backend development, with extensive experience building modern web applications and digital products. I have successfully developed and delivered numerous projects, from responsive websites to complex full-stack applications, integrating APIs, databases, and cloud services. My expertise includes TypeScript, JavaScript, React, Next.js, Node.js, Express, and database management with MySQL, PostgreSQL, and MongoDB. I excel in problem-solving, clean coding practices, and creating scalable, maintainable, and high-performance software solutions."
  },

  "serviceSection": {
    "title": " Design, develop, and launch end-to-end.",
    "bio1": "From the first line of code to a polished live product — I build websites that perform, scale, and inspire.",
    "bio2": "Whether starting from scratch or transforming what exists, I craft digital experiences that deliver at every stag",
    "services": [
      {
        "title": "Frontend Development",
        "content": "Building responsive, interactive, and user-friendly web interfaces using React, Next.js, and modern frontend tools."
      },
      {
        "title": "Backend Development",
        "content": "Creating robust server-side applications with Node.js, Express, and database integration using MongoDB and SQL."
      },
      {
        "title": "Full Stack Solutions",
        "content": "Designing and delivering end-to-end web applications, handling both frontend and backend seamlessly."
      },
      {
        "title": "UI/UX & Web Design",
        "content": "Designing clean, modern, and intuitive user interfaces for websites and applications."
      },
      {
        "title": "API Development & Integration",
        "content": "Developing RESTful APIs and integrating third-party services to extend functionality."
      },
      {
        "title": "Deployment & DevOps",
        "content": "Deploying web applications to cloud platforms, setting up CI/CD pipelines, and optimizing performance."
      }
    ]
  }
}
