{
  "name": "Youssef Elsabawy",
  "heroSection": {
    "myPicture": "",
    "bio": "Versatile Full Stack Engineer shaping modern products and experiences that connect people, ideas, and technology.",
    "happyClients": [
      {
        "pictureUrl": "/companies/Eontech.png",
        "alt": "Eontech",
        "width": 110
      },
      {
        "pictureUrl": "/companies/goinvoice.png",
        "alt": "goinvoice",
        "width": 120
      },
      {
        "pictureUrl": "/companies/Paintiro.png",
        "alt": "Paintiro",
        "width": 110
      },
      {
        "pictureUrl": "/companies/Ingenium.png",
        "alt": "Ingenium",
        "width": 150
      },
      {
        "pictureUrl": "/companies/Sentiomail.png",
        "alt": "Sentiomail",
        "width": 150
      }
    ]
  },

  "aboutSection": {
    "whoIs": "Youssef",
    "startYear": 2021,
    "bio": "I’m Youssef Elsabawy, a Full Stack Engineer with {yearsOfExperience} of experience in both frontend and backend development, creating digital products that perform, scale, and inspire."
  },
  "aboutPage": {
    "whoIs": "Youssef Elsabawy",
    "story": "I was born on 1st August 1999 in Alexandria, Egypt. From a young age, I developed a passion for basketball, playing actively from 6 to 16 years old, which taught me discipline, teamwork, and perseverance. In 2017, I began studying Computer Science, exploring programming and problem-solving, and graduated in 2021 with a solid foundation in technology. After graduation, I joined the Egyptian Army, serving in the Naval Security, where I gained resilience and the ability to perform under pressure. Following my service, I started my professional career at TechHive as a Full Stack Engineer, applying my skills to real-world projects and continuously growing as a developer.",
    "reflection": "These experiences from sports to academics, military service, and professional work have shaped who I am today. They taught me discipline, curiosity, perseverance, and problem-solving. I am committed to continuous learning, personal growth, and making a positive impact through my work and life.",
    "Technical": "I am a highly skilled Full Stack Software Engineer specializing in frontend and backend development, with extensive experience building modern web applications and digital products. I have successfully developed and delivered numerous projects, from responsive websites to complex full-stack applications, integrating APIs, databases, and cloud services. My expertise includes TypeScript, JavaScript, React, Next.js, Node.js, Express, and database management with MySQL, PostgreSQL, and MongoDB. I excel in problem-solving, clean coding practices, and creating scalable, maintainable, and high-performance software solutions."
  },

  "serviceSection": {
    "title": " Design, develop, and launch end-to-end.",
    "bio1": "From the first line of code to a polished live product — I build websites that perform, scale, and inspire.",
    "bio2": "Whether starting from scratch or transforming what exists, I craft digital experiences that deliver at every stag",
    "services": [
      {
        "title": "Frontend Development",
        "content": "Building responsive, interactive, and user-friendly web interfaces using React, Next.js, and modern frontend tools."
      },
      {
        "title": "Backend Development",
        "content": "Creating robust server-side applications with Node.js, Express, and database integration using MongoDB and SQL."
      },
      {
        "title": "Full Stack Solutions",
        "content": "Designing and delivering end-to-end web applications, handling both frontend and backend seamlessly."
      },
      {
        "title": "UI/UX & Web Design",
        "content": "Designing clean, modern, and intuitive user interfaces for websites and applications."
      },
      {
        "title": "API Development & Integration",
        "content": "Developing RESTful APIs and integrating third-party services to extend functionality."
      },
      {
        "title": "Deployment & DevOps",
        "content": "Deploying web applications to cloud platforms, setting up CI/CD pipelines, and optimizing performance."
      }
    ]
  },

  "socialLinks": [
    {
      "name": "Email",
      "url": "mailto:yelsabawyy@gmail.com",
      "icon": "email"
    },
    {
      "name": "Facebook",
      "url": "https://www.facebook.com/youssef.elsabawy",
      "icon": "facebook"
    },
    {
      "name": "Instagram",
      "url": "https://instagram.com/yelsabawyy",
      "icon": "instagram"
    },
    {
      "name": "GitHub",
      "url": "https://github.com/yelsabawyy",
      "icon": "github"
    }
  ],

  "resume": {
    "personalInfo": {
      "name": "Youssef Elsabawy",
      "title": "Full Stack Developer",
      "phone": "+201283230322",
      "email": "yelsabawyy@gmail.com",
      "linkedin": "https://linkedin.com/in/yelsabawyy",
      "github": "https://github.com/yelsabawyy"
    },
    "skills": {
      "languages": ["TypeScript", "JavaScript", "Java", "C++", "Python"],
      "frontend": [
        "React.js",
        "Next.js",
        "Angular.js",
        "HTML",
        "CSS",
        "Tailwind CSS",
        "Bootstrap"
      ],
      "apis": ["REST API", "GraphQL", "Socket.io", "JWT", "AJAX"],
      "backend": ["Node.js", "Express", "Laravel", "ASP.NET Core"],
      "databases": ["MySQL", "PostgreSQL", "MongoDB", "Redis"],
      "devopsCloud": ["Docker", "GIT", "AWS"]
    },
    "experience": [
      {
        "company": "Tech Hive",
        "role": "Full Stack Developer",
        "period": "Jan/2024 - Present",
        "projects": [
          {
            "name": "Ingenium",
            "url": "https://ingeniumpros.com",
            "details": [
              "Built 90% of the frontend for Ingenium, including dynamic calendars, milestone tracking, invoicing systems, notifications, and messaging features.",
              "Developed 100% of the dashboard to provide comprehensive user control and insights.",
              "Integrated backend APIs for real-time data synchronization across the platform."
            ]
          },
          {
            "name": "App ASAP",
            "url": "https://appasap.app/",
            "details": [
              "Improved error monitoring for Terraform issues using AWS services.",
              "Enhanced system reliability and streamlined troubleshooting."
            ]
          }
        ]
      },
      {
        "company": "ITI (Information Technology Institute)",
        "role": "Internship",
        "period": "Jul 2023 – Nov 2023",
        "details": [
          "Developed the auction system, including triggers and functions to validate winning bids.",
          "Handled 50% of both frontend and backend development using C# and .NET in an agile team."
        ]
      },
      {
        "company": "Alexandria Port Egypt",
        "role": "Internship",
        "period": "Aug 2019 – Sep 2019",
        "details": [
          "Worked with a team to normalize databases and improve data integrity.",
          "Helped enhance database reliability and performance through normalization."
        ]
      }
    ],
    "education": [
      {
        "degree": "Bachelor's Degree in Computer Science",
        "university": "Alexandria University",
        "period": "Sep 2017 – Jun 2021",
        "gpa": "3.64 / 4.0"
      }
    ],
    "projects": [
      {
        "name": "Eontech",
        "year": 2025,
        "details": [
          "Built 100% of the frontend for the company website using modern frameworks.",
          "Contributed 50% to backend development and deployment processes.",
          "Collaborated with team members to ensure smooth integration between frontend and backend.",
          "Optimized deployment pipeline for faster and more reliable releases."
        ]
      },
      {
        "name": "Auction System",
        "year": 2023,
        "details": [
          "Developed a robust auction system, fostering real-time bidding engagement.",
          "Automated daily trigger for processing and updating completed auction statuses."
        ]
      },
      {
        "name": "Ecommerce (Paintiro)",
        "year": 2022,
        "details": [
          "Implemented a visually appealing and responsive Artworks brand website, featuring real-time communication and enhanced user engagement through messaging.",
          "Implemented a robust REST API for E-commerce, showcasing proficiency in effective data management."
        ]
      },
      {
        "name": "Mobile Application (Roaden)",
        "year": 2021,
        "details": [
          "Implemented efficient backend functionality, ensuring scalability and reliability using MongoDB.",
          "Developed an application with Flutter and Dart, prioritizing efficiency and seamless user experience."
        ]
      },
      {
        "name": "Ecommerce Website [Search by image engine] — Graduation Project",
        "year": 2021,
        "details": [
          "Developed an E-commerce website with a seamless user experience using modern web technologies.",
          "Implemented image search, Role Authorization, Data Validation, and real-time messaging with Socket."
        ]
      }
    ],
    "socialLinks": [
      {
        "name": "Email",
        "url": "mailto:yelsabawyy@gmail.com",
        "icon": "email",
        "color": "white"
      },
      {
        "name": "LinkedIn",
        "url": "https://linkedin.com/in/yelsabawyy",
        "icon": "linkedin",
        "color": "#0A66C2"
      },
      {
        "name": "GitHub",
        "url": "https://github.com/yelsabawyy",
        "icon": "github",
        "color": "white"
      },
      {
        "name": "Facebook",
        "url": "https://facebook.com/YOUR_USERNAME",
        "icon": "facebook",
        "color": "#1877F2"
      },
      {
        "name": "Instagram",
        "url": "https://instagram.com/YOUR_USERNAME",
        "icon": "instagram",
        "color": "#E4405F"
      },
      {
        "name": "LeetCode",
        "url": "https://leetcode.com/YOUR_USERNAME",
        "icon": "leetcode",
        "color": "#FFA116"
      },
      {
        "name": "Snapchat",
        "url": "https://snapchat.com/add/YOUR_USERNAME",
        "icon": "snapchat",
        "color": "#FFFC00"
      }
    ]
  },
  "project": [
    {
      "url": "https://eontech.dev/",
      "title": "Eontech.dev",
      "Description": "A professional software company website based in the USA. I built 100% of the frontend and handled 50% of the backend and deployment, ensuring a responsive, scalable, and reliable platform."
    },
    {
      "url": "https://paintiro.vercel.app/",
      "title": "Paintiro",
      "Description": "A full-stack E-commerce platform for selling paintings. I built 100% of the frontend and backend, including a powerful admin dashboard for managing artworks, users, and orders."
    },
    {
      "url": "https://www.ingeniumpros.com/",
      "title": "Ingenium pros",
      "Description": "A freelancing and outsourcing platform similar to Upwork, designed to connect businesses with top talent across various industries. I developed 90% of the frontend, including interactive dashboards, milestone tracking, invoicing, notifications, and real-time messaging. I also integrated backend APIs to ensure smooth and reliable data synchronization, enhancing the overall user experience."
    },
    {
      "url": "https://email-messaging-system.vercel.app/",
      "title": "Sentiomail",
      "Description": "Email Messaging System, Send emails quickly and securely from My website with easy to use controls."
    }
  ]
}
